11/data/attachments/e282c4762093824a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d68ab28d-3076-45c5-9efc-575aac863dcc</nif:username>
            <nif:friendToBeAdded>Joseph_positive_Friend_4053_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>